In [3]:
import numpy as np
import pandas as pd

In [2]:
print "Hello CS109"

print "I love IPython"

a = np.zeros(3)
a.clip?

Hello CS109
I love IPython

In [4]:
u_cols = ['user_id', 'age', 'sex', 'occupation', 'zip_code']

users = pd.read_csv('http://files.grouplens.org/datasets/movielens/ml-100k/u.user', sep='|', names=u_cols)

users.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

In [6]:
r_cols = ['user_id', 'movie_id', 'rating', 'unix_timestamp']
ratings = pd.read_csv('http://files.grouplens.org/datasets/movielens/ml-100k/u.data', sep='\t', names=r_cols)

ratings.head()

   user_id  movie_id  rating  unix_timestamp
0      196       242       3       881250949
1      186       302       3       891717742
2       22       377       1       878887116
3      244        51       2       880606923
4      166       346       1       886397596

In [8]:
m_cols = ['movie_id', 'title', 'release_date', 'video_release_date', 'imdb_url']

movies = pd.read_csv('http://files.grouplens.org/datasets/movielens/ml-100k/u.item', 
                     sep="|", names=m_cols, usecols=range(5))

# usecols was added here because the datasets has more columns than defined in m_cols.

movies.head()

,movie_id,title,release_date,video_release_date,imdb_url
0,1,Toy Story (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...
1,2,GoldenEye (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...
2,3,Four Rooms (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Four%20Rooms%...
3,4,Get Shorty (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Get%20Shorty%...
4,5,Copycat (1995),01-Jan-1995,NaN,http://us.imdb.com/M/title-exact?Copycat%20(1995)

In [9]:
# this is just the data types of each column
print movies.dtypes

print

print movies.describe()
# the .describe method only displays information for the two columns - movie_id & video_release_date because 
# they are the only two columns with numeric data.

movie_id                int64
title                  object
release_date           object
video_release_date    float64
imdb_url               object
dtype: object

          movie_id  video_release_date
count  1682.000000                 0.0
mean    841.500000                 NaN
std     485.695893                 NaN
min       1.000000                 NaN
25%     421.250000                 NaN
50%     841.500000                 NaN
75%    1261.750000                 NaN
max    1682.000000                 NaN

In [15]:
# single DataFrameColumn is called a series

print users.head()
print 
print users['occupation'].head()

columns_you_want = ['occupation', 'sex']
print
print users[columns_you_want].head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

0    technician
1         other
2        writer
3    technician
4         other
Name: occupation, dtype: object

   occupation sex
0  technician   M
1       other   F
2      writer   M
3  technician   M
4       other   F

In [16]:
# iloc is used to filter by rows instead of columns

In [17]:
oldUsers = users[users.age > 25]
oldUsers.head()

   user_id  age sex     occupation zip_code
1        2   53   F          other    94043
4        5   33   F          other    15213
5        6   42   M      executive    98101
6        7   57   M  administrator    91344
7        8   36   M  administrator    05201

In [29]:
## QUiZ 1
# show users aged 40 and male

maleUsers = users[users.sex == 'M']
male40Users = maleUsers[maleUsers.age > 40]
male40Users.head()

    user_id  age sex     occupation zip_code
5         6   42   M      executive    98101
6         7   57   M  administrator    91344
9        10   53   M         lawyer    90703
12       13   47   M       educator    29206
13       14   45   M      scientist    55106

In [30]:
## QUIZ 2
# show the mean age of female programmers

females = users[users.sex == 'F']
print females.age.mean()

33.8131868132

In [32]:
# Answers

users[(users.age > 40) & (users.sex == 'M')]
users.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

In [36]:
# Answer
# show the mean age of female programmers

femaleProgrammers = users[(users.sex == 'F') & (users.occupation == 'programmer')]
femaleProgrammers.describe()

          user_id        age
count    6.000000   6.000000
mean   411.166667  32.166667
std    149.987222   5.115336
min    292.000000  26.000000
25%    313.000000  28.250000
50%    378.000000  32.000000
75%    416.750000  36.500000
max    698.000000  38.000000

In [35]:
print femaleProgrammers.age.mean()

32.1666666667

In [42]:
## Split-Apply-Combine

# find dilligent users
# split data by user ID
# count ratings
# combine result

print ratings.head()
print
grouped_data = ratings['movie_id'].groupby(ratings['user_id'])
ratings_per_user = grouped_data.count()
ratings_per_user.head(5)

   user_id  movie_id  rating  unix_timestamp
0      196       242       3       881250949
1      186       302       3       891717742
2       22       377       1       878887116
3      244        51       2       880606923
4      166       346       1       886397596

user_id
1    272
2     62
3     54
4     24
5    175
Name: movie_id, dtype: int64

In [68]:
# average rating per movie
# ratings.head()
grouped_data = ratings['rating'].groupby(ratings['movie_id'])
average_ratings = grouped_data.mean()

In [69]:
print "Average Ratings"
print average_ratings.head()

Average Ratings
movie_id
1    3.878319
2    3.206107
3    3.033333
4    3.550239
5    3.302326
Name: rating, dtype: float64

In [78]:
## Movie titles with the highest average rating

maximum_rating = average_ratings.max()
good_movie_ids = average_ratings[average_ratings == maximum_rating].index

In [83]:
# Good movie ids
print good_movie_ids
print

# Check the movie datasets to get the title of each movie using their ID
print "Best Movie Titles"
print movies[movies.movie_id.isin(good_movie_ids)].title

Int64Index([814, 1122, 1189, 1201, 1293, 1467, 1500, 1536, 1599, 1653], dtype='int64', name=u'movie_id')

Best Movie Titles
813                         Great Day in Harlem, A (1994)
1121                       They Made Me a Criminal (1939)
1188                                   Prefontaine (1997)
1200           Marlene Dietrich: Shadow and Light (1996)
1292                                      Star Kid (1997)
1466                 Saint of Fort Washington, The (1993)
1499                            Santa with Muscles (1996)
1535                                 Aiqing wansui (1994)
1598                        Someone Else's America (1995)
1652    Entertaining Angels: The Dorothy Day Story (1996)
Name: title, dtype: object

In [86]:
# This data leads to suspicion as the probability of movies getting a 5 as a rating should be low
# this raises eyebrows and we should check how many people actually rated that movie

how_many_ratings = grouped_data.count()

print "Number of ratings per movie"
print how_many_ratings[average_ratings == maximum_rating]

# as shown in the table most of the movies with very high ratings only got voted by one person which is not really
# an optimal jusge of if a movie is good or now

Number of ratings per movie
movie_id
814     1
1122    1
1189    3
1201    1
1293    3
1467    2
1500    2
1536    1
1599    1
1653    1
Name: rating, dtype: int64

In [87]:
# Another way to get the average rating is to pass a function

average_ratings = grouped_data.apply(lambda f: f.mean())
average_ratings.head()

movie_id
1    3.878319
2    3.206107
3    3.033333
4    3.550239
5    3.302326
Name: rating, dtype: float64

In [98]:
# Get the average rating per user

grouped_data = ratings['rating'].groupby(ratings['user_id'])
average_rating_per_user = grouped_data.mean()
average_rating_per_user.head()

user_id
1    3.610294
2    3.709677
3    2.796296
4    4.333333
5    2.874286
Name: rating, dtype: float64

In [105]:
# List all occupations and if they are male or female dominant

# Split
grouped_data = users['sex'].groupby(users['occupation'])

# Aplly & Combine
male_dominant_occupation = grouped_data.apply(lambda f: sum(f == 'M') > sum(f == 'F'))
print male_dominant_occupation

occupation
administrator     True
artist            True
doctor            True
educator          True
engineer          True
entertainment     True
executive         True
healthcare       False
homemaker        False
lawyer            True
librarian        False
marketing         True
none              True
other             True
programmer        True
retired           True
salesman          True
scientist         True
student           True
technician        True
writer            True
Name: sex, dtype: bool

In [108]:
print grouped_data.count()

occupation
administrator     79
artist            28
doctor             7
educator          95
engineer          67
entertainment     18
executive         32
healthcare        16
homemaker          7
lawyer            12
librarian         51
marketing         26
none               9
other            105
programmer        66
retired           14
salesman          12
scientist         31
student          196
technician        27
writer            45
Name: sex, dtype: int64

In [ ]:
# Web Scraping

# There are usually files where people explicitly don't want you to scrape, they are usually defined
# in a text file called robots.txt - usually located at the top-level directory of a web server